Revit 2027 API
UnitTypeId.KipsPerFoot Property
 Kips per foot.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId KipsPerFoot { get; }
Public Shared ReadOnly Property KipsPerFoot As ForgeTypeId
	Get
public:
static property ForgeTypeId^ KipsPerFoot {
	ForgeTypeId^ get ();
}
static member KipsPerFoot : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace